/*!
 *
 * ███╗   ███╗█████╗██████████╗   ██╗██████╗█████████████████╗   ████████╗██╗██████╗
 * ████╗ ██████╔══████╔════████╗  ████╔════╝██╔════╚══██╔══██║   ████╔══██████╔═══██╗
 * ██╔████╔██████████████╗ ██╔██╗ ████║  ██████████╗  ██║  ██║   ████║  ██████║   ██║
 * ██║╚██╔╝████╔══████╔══╝ ██║╚██╗████║   ██╚════██║  ██║  ██║   ████║  ██████║   ██║
 * ██║ ╚═╝ ████║  ███████████║ ╚████╚██████╔███████║  ██║  ╚██████╔██████╔██╚██████╔╝
 * ╚═╝     ╚═╚═╝  ╚═╚══════╚═╝  ╚═══╝╚═════╝╚══════╝  ╚═╝   ╚═════╝╚═════╝╚═╝╚═════╝
 *
 * Developed by MaengStudio.
 * https://maengstudio.com/
 *
 * Date: 2022-01-02
 *
 * 저작권으로 보호 받고 있는 MaengStudio의 스킨입니다.
 * 해당 프로그램의 소스를 무단으로 복제 및 배포 시 경고 및 선처 없이 저작권법에 의한 '민, 형사상 법적조치' 처벌 됩니다.
 *
 */

jq(() => {
    licenseJsPkg.init();
});

const licenseJsPkg = {
    init: function () {
        this.license();
    },
    license: () => {
        const _ms = `%cMaengStudio%c\nhttps://maengstudio.com/`;
        console.log(_ms, "color:#fff; font-size:18px; font-weight:600; background:#000; padding:10px; margin:10px 0;", "color:#000; font-size:12px; font-weight:600; margin-bottom:10px");
    },
};
